//==============================================================================
//
// ポリゴン管理[mozPolygon.cpp]
// Author : Yasuaki Yamashita : 2014/08/22
//
//==============================================================================

//******************************************************************************
// include
//******************************************************************************
#include "mozPolygon.h"

//==============================================================================
// コンストラクタ
//------------------------------------------------------------------------------
PolygonManager::PolygonManager()
{
	// バッファ確保
	if (FAILED(pDevice->CreateVertexBuffer(
		sizeof(VERTEX_2D)* kMaxBufferBoard2D,		// 最大数分確保
		(D3DUSAGE_DYNAMIC | D3DUSAGE_WRITEONLY),	// 動的確保、書き込みのみ
		NULL,										// 2DFVFデータ
		D3DPOOL_DEFAULT,							// メモリを自動配置
		&m_pVtxBuffBoard,							// 統括バッファ
		NULL
		)))
	{
		//アサートチェック
		ASSERT((m_pVtxBuffBoard != NULL), "頂点バッファが確保できませんでした。");
		return;
	}
}

//==============================================================================
// デストラクタ
//------------------------------------------------------------------------------
PolygonManager::~PolygonManager()
{

}


//EOF